# pandas 패키지와 DataFrame 객체

In [2]:
import numpy as np
import pandas as pd

In [3]:
np.random.seed(0)
df=pd.DataFrame(np.random.randint(10,size=(3,4)),columns=['col1','col2','col3','col4'])

In [4]:
df

   col1  col2  col3  col4
0     5     0     3     3
1     7     9     3     5
2     2     4     7     6

In [5]:
df["col2"]

0    0
1    9
2    4
Name: col2, dtype: int32

In [6]:
df.col2

0    0
1    9
2    4
Name: col2, dtype: int32

In [8]:
 df.loc[0,"col2":"col3"] #series형태로 반환

col2    0
col3    3
Name: 0, dtype: int32

In [9]:
df. loc[0:0,"col2":"col3"] #슬라이싱 >> daataframe

   col2  col3
0     0     3

In [10]:
df.loc[[0],"col2":'col3']#벡터활용 >> dataframe

   col2  col3
0     0     3

In [11]:
df. loc[0:2,"col2":"col3"] # 슬라이싱 사용 했으니까 dataframe 반환 되겠지?

   col2  col3
0     0     3
1     9     3
2     4     7

In [12]:
df.loc[(df["col2"]>2)&(df["col3"] < 5), "col2":"col3"] #두 조건을 만족하는 "행 인덱스"를 찾아서~

   col2  col3
1     9     3

# iloc

In [13]:
df.iloc[0,1:3] #슬라이싱 사용했지만, sereis 반환!

col2    0
col3    3
Name: 0, dtype: int32

In [14]:
df.iloc[0:1,1:3] # 슬라이싱이 두개니까 dataframe

   col2  col3
0     0     3

In [16]:
df.iloc[[0],1:3]

   col2  col3
0     0     3

In [18]:
df.iloc[0:3,1:3] #행 0,1,2 열 0,1,2

   col2  col3
0     0     3
1     9     3
2     4     7

# DataFrame 객체의 열 추가 방법

In [35]:
np.random.seed(0)
df=pd.DataFrame(np.random.randint(10,size=(3,4)),columns=['col1','col2','col3','col4'])

In [36]:
df["total"]=df.sum(axis=1) #연산후 새로운 column 추가
df

   col1  col2  col3  col4  total
0     5     0     3     3     11
1     7     9     3     5     24
2     2     4     7     6     19

# DataFrame 객체의 행과 열 제거

In [37]:
df=df. drop(columns=["col4","total"],axis=0)
df

   col1  col2  col3
0     5     0     3
1     7     9     3
2     2     4     7

In [38]:
df.drop(index=1,axis=1)

   col1  col2  col3
0     5     0     3
2     2     4     7

# DataFrame 객체의 NULL 값 연산

In [40]:
df=pd.DataFrame([[1,2,3],
                  [4,5,6],
                  [np.nan,8,9],
                  [10,np.nan,12]])
df

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   NaN  8.0   9
3  10.0  NaN  12

In [42]:
df.dropna(axis=1) #axis 차이도 알아두자구! axis=0은 행을 뜻하고

    2
0   3
1   6
2   9
3  12

In [43]:
df.dropna(axis=0) # axis=1 은 열을 뜻해

     0    1  2
0  1.0  2.0  3
1  4.0  5.0  6

In [44]:
df.fillna(df.mean(axis=0)) #행의 평균값으로 NULL을 채워버리는거지!

      0    1   2
0   1.0  2.0   3
1   4.0  5.0   6
2   5.0  8.0   9
3  10.0  5.0  12

# DataFrame 객체의 Join

In [53]:
df1=pd.DataFrame({'name':['이순신','강감찬','을지문덕','김유신'],
                 'dept':['연구개발','영업','연구개발','인사']})
df2=pd.DataFrame({'emp_name':['강감찬','을지문덕','이순신','이순신'],
                 'project': ["S","D","A","S"]})
df1

   name  dept
0   이순신  연구개발
1   강감찬    영업
2  을지문덕  연구개발
3   김유신    인사

In [54]:
df2

  emp_name project
0      강감찬       S
1     을지문덕       D
2      이순신       A
3      이순신       S

In [56]:
pd.merge(df1,df2,left_on="name",right_on="emp_name").drop("emp_name",axis=1) 
#inner join방식 - 맵핑할 대상이 없는 경우 제외시키고 조인

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D

In [57]:
pd.merge(df1,df2,how="outer",left_on="name",right_on="emp_name").drop("emp_name",axis=1) 
#outer join방식- 없는 데이터는 nan으로 채워줌

   name  dept project
0   이순신  연구개발       A
1   이순신  연구개발       S
2   강감찬    영업       S
3  을지문덕  연구개발       D
4   김유신    인사     NaN

# DataFrame객체의 정렬

In [60]:
import seaborn as sns
titanic=sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [62]:
titanic.sort_values(by=["fare","sex"],ascending=[False,True]).head()
#values를 이용해서 정렬!
#.head()>>위에서부터 5개
#tail() >> 아래서부터 5개

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False

In [63]:
titanic.groupby("sex")[["survived"]].aggregate("mean")
#[["survived"]]가 아닌 ["survived"]로 해주면 series로 나옴

        survived
sex
female  0.742038
male    0.188908

In [65]:
titanic.groupby("sex")[["survived"]].aggregate("mean").apply(lambda x:x-x.mean())
#평균을 이용한 중심이동 >> 데이터 표준화

        survived
sex
female  0.276565
male   -0.276565

# DataFrame객체와 피벗 테이블

In [67]:
titanic.groupby(["sex","class"])["survived"].aggregate("mean").unstack()
#unstack을 이용해서 ["survied"]임에도 불구하고 DataFrame 형태로 추출

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [69]:
titanic.pivot_table("survived",index="sex",columns="class")
#위의 코드와 결과가 같다. 보기 편하고 깔끔한 pivot table을 사용하자!

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447